{
"COMP_RES_1000" = "sysinfo";
"COMP_RES_2000" = "System Information";
"COMP_RES_7000" = "cError:Character variable where error text will be returned when an error occurs.";
"COMP_RES_8000" = "$getusername:$getusername(cError) returns username of the user currently signed in on the computer Omnis Studio is running on.";
"COMP_RES_8001" = "$getmodel:$getmodel(cError) returns model of the computer Omnis Studio is currently running on.";
"COMP_RES_8002" = "$getmanufacturer:$getmanufacturer(cError) returns manufacturer of the computer Omnis Studio is currently running on.";
"COMP_RES_8003" = "$getname:$getname(cError) returns name of the computer Omnis Studio is currently running on. Computer name is hostname on macOS and Linux.";
"COMP_RES_8004" = "$getmacaddr:$getmacaddr(cError) returns MAC address of the computer Omnis is currently running on. If error occurrs, it will be returned in cError.";
"COMP_RES_10000" = "Not enough parameters have been passed.";
"COMP_RES_10001" = "Could not retrieve username from system.";
"COMP_RES_10002" = "Could not retrieve computer model from system.";
"COMP_RES_10003" = "Could not retrieve computer name from system.";
"COMP_RES_10004" = "Could not retrieve MAC address from system.";
"COMP_RES_10005" = "Could not retrieve computer manufacturer from system.";
"COMP_RES_31000" = "sysinfoWndProc";
}
